-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2016-09-01 04:46:15
-- 服务器版本： 10.1.13-MariaDB
-- PHP Version: 5.6.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `library`
--

-- --------------------------------------------------------

--
-- 表的结构 `book_table`
--

CREATE TABLE `book_table` (
  `ID` int(11) UNSIGNED NOT NULL COMMENT '内部使用',
  `BOOK_NAME` text NOT NULL,
  `WRITER` text NOT NULL,
  `PUBLISHER` text NOT NULL,
  `TYPE` text NOT NULL,
  `ISBN` bigint(64) UNSIGNED NOT NULL,
  `IMG` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `book_table`
--

INSERT INTO `book_table` (`ID`, `BOOK_NAME`, `WRITER`, `PUBLISHER`, `TYPE`, `ISBN`, `IMG`) VALUES
(1, 'Word Excel PPT 2013办公应用从入门到精通', '神龙工作室', '人民邮电出版社', '计算机与互联网', 9787115375148, 'images/book_covers/9787115375148.jpg'),
(2, '软件开发视频大讲堂：Java从入门到精通', '明日科技', '清华大学出版社', '计算机与互联网', 9787302287568, 'images/book_covers/9787302287568.jpg'),
(3, 'Python基础教程（第2版 修订版）', '[挪] Magnus Lie Hetland 著；司维，曾军崴，谭颖华 译', '人民邮电出版社', '计算机与互联网', 9787115353528, 'images/book_covers/9787115353528.jpg'),
(4, '机器学习', '周志华 著', '清华大学出版社', '计算机与互联网', 9787302423287, 'images/book_covers/9787302423287.jpg'),
(5, '鸟哥的Linux私房菜 （基础学习篇 第三版）', '鸟哥 著；王世江 编', ' 人民邮电出版社', '计算机与互联网', 9787115226266, 'images/book_covers/9787115226266.jpg'),
(6, 'Java编程思想（第4版）', '[美] Bruce Eckel 著；陈昊鹏 译', ' 机械工业出版社', '计算机与互联网', 9787111213826, 'images/book_covers/9787111213826.jpg'),
(7, 'JavaScript高级程序设计（第3版）', '[美] Nicholas C.Zakas 著；李松峰，曹力 译', '人民邮电出版社', '计算机与互联网', 9787115275790, 'images/book_covers/9787115275790.jpg'),
(8, 'Word Excel PPT 2010办公应用从入门到精通', '王作鹏，殷慧文 著；神龙工作室 编', '人民邮电出版社', '计算机与互联网', 9787115316981, 'images/book_covers/9787115316981.jpg'),
(9, 'Photoshop CS6完全自学教程', '李金明，李金荣 著', '人民邮电出版社', '计算机与互联网', 9787115284167, 'images/book_covers/9787115284167.jpg'),
(10, 'C Primer Plus（第5版 中文版）', '[美] 普拉塔（Prata S.） 著；云巅工作室 编', '人民邮电出版社', '计算机与互联网', 9787115130228, 'images/book_covers/9787115130228.jpg'),
(11, '数学之美（第二版）', '吴军 著', '人民邮电出版社', '计算机与互联网', 9787115373557, 'images/book_covers/9787115373557.jpg'),
(12, 'C++ Primer（中文版 第5版）', 'Stanley B. Lippman，Josée Lajoie，Barbara E. Moo 著；王刚，杨巨峰 译', '电子工业出版社', '计算机与互联网', 9787121155352, 'images/book_covers/9787121155352.jpg'),
(13, '必然', '[美] 凯文·凯利 著', '电子工业出版社', '计算机与互联网', 9787121272394, 'images/book_covers/9787121272394.jpg'),
(14, 'OReilly精品图书系列：JavaScript权威指南（第6版）', '[美] David Flanagan 著；淘宝前端团队 译', '机械工业出版社', '计算机与互联网', 9787111376613, 'images/book_covers/9787111376613.jpg'),
(15, '第一行代码 Android', '郭霖 著', '人民邮电出版社', '计算机与互联网', 9787115362865, 'images/book_covers/9787115362865.jpg'),
(16, 'Word/Excel/PPT 2016 办公三合一傻瓜书', '卢源 著', '中国铁道出版社', '计算机与互联网', 9787113218508, 'images/book_covers/9787113218508.jpg'),
(17, 'Java核心技术（卷1）：基础知识（原书第9版）', 'Cay S. Horstmann，Gary Cornell 著；周立新，陈波，叶乃文 等 译', '机械工业出版社', '计算机与互联网', 9787111445142, 'images/book_covers/9787111445142.jpg'),
(18, '算法导论（原书第3版）', '[美] Thomas H.Cormen，[美] Charles E.Leiserson，[美] Ronald L.Rivest，[美] Clifford Stein 著；殷建平，徐云，王刚 等 译', '机械工业出版社', '计算机与互联网', 9787111407010, 'images/book_covers/9787111407010.jpg'),
(19, '疯狂Java讲义（第3版）', '李刚 著', '电子工业出版社', '计算机与互联网', 9787121236693, 'images/book_covers/9787121236693.jpg'),
(20, 'C++ Primer Plus（第6版 中文版）', '[美] Stephen Prata 著；张海龙，袁国忠 译', '人民邮电出版社', '计算机与互联网', 9787115279460, 'images/book_covers/9787115279460.jpg'),
(21, '米切尔恩德作品典藏 永远讲不完的故事（新译本）', '[德] 米切尔·恩德 著；杨武能 译', '二十一世纪出版社', '少儿', 9787539183428, 'images/book_covers/9787539183428.jpg'),
(22, '米切尔恩德作品典藏 毛毛（新译本）', '[德] 米切尔·恩德 著；杨武能 译', '二十一世纪出版社', '少儿', 9787539183749, 'images/book_covers/9787539183749.jpg'),
(23, '噼里啪啦系列（套装共7册）', '[日] 佐佐木洋子 绘', '二十一世纪出版社', '少儿', 9787539147659, 'images/book_covers/9787539147659.jpg'),
(24, '开车出发系列绘本 第一辑（套装共7册）', '[日] 间濑直方 著', '二十一世纪出版社集团', '少儿', 7539103002958, 'images/book_covers/7539103002958.jpg'),
(25, '不一样的卡梅拉手绘本 礼盒装（1-12册）', '克里斯提昂·约里波瓦 著', '二十一世纪出版社集团', '少儿', 9787556817191, 'images/book_covers/9787556817191.jpg'),
(26, '曹文轩纯美小说：草房子（2016版）', '曹文轩 著', '江苏凤凰少年儿童出版社', '少儿', 9787534618727, 'images/book_covers/9787534618727.jpg'),
(27, '开车出发-故事列车系列（套装共6册）', '[日] 间濑直方　 著', '二十一世纪出版社集团', '少儿', 7556803002954, 'images/book_covers/7556803002954.jpg'),
(29, '亲子情商教育系列：培养孩子强大内心', '木头人儿童创想中心 编', '中国人口出版社', '少儿', 9787510132988, 'images/book_covers/9787510132988.jpg'),
(30, '不一样的卡梅拉动漫绘本 礼盒装（23-32册）', '克里斯提昂·约里波瓦 著', '二十一世纪出版社集团', '少儿', 9787556817221, 'images/book_covers/9787556817221.jpg'),
(33, '小王子（纯美珍藏绘本）', '[法] 安东尼·德·圣-埃克苏佩里 著；国开童媒（北京）文化传播有限公司 编；梅思繁 译', '中央广播电视大学出版社', '少儿', 9787304074951, 'images/book_covers/9787304074951.jpg'),
(36, '米菲认知洞洞书', '迪克·布鲁纳 著；杨定安 译', '二十一世纪出版社', '少儿', 7556803005105, 'images/book_covers/7556803005105.jpg'),
(37, '世界地图：跟爸爸一起去旅行（百科知识版）', '[英] 尼克·柯雷恩 著；[英] 大卫·迪恩 绘', ' 成都地图出版社', '少儿', 9787555701644, 'images/book_covers/9787555701644.jpg'),
(38, '培生幼儿启蒙英语Level A', '克莱尔·卢埃林等 著；【英】朱丽·安德森 绘', '长江少年儿童出版社', '少儿', 9787556029709, 'images/book_covers/9787556029709.jpg'),
(39, '我的天使3（中英文双语）', '[美] 彼尚，安裘密 著', '云南人民出版社', '少儿', 9787222142350, 'images/book_covers/9787222142350.jpg'),
(40, '海润阳光·宝宝视觉激发·经典版', '陈长海 编', '中国人口出版社', '少儿', 9787510103148, 'images/book_covers/9787510103148.jpg'),
(41, '我爱幼儿园', '[法] 塞尔日·布洛克 著；张艳 译', '北京科学技术出版社', '少儿', 9787530459324, 'images/book_covers/9787530459324.jpg'),
(42, '不一样的卡梅拉动漫绘本', '克里斯提昂·约里波瓦 著', '二十一世纪出版社集团', '少儿', 9787556817214, 'images/book_covers/9787556817214.jpg'),
(43, '月亮的味道', '[瑞士] 麦克·格雷涅茨 著；漪然，彭懿 译', '二十一世纪出版社', '少儿', 9787539135892, 'images/book_covers/9787539135892.jpg'),
(44, '不一样的卡梅拉手绘版·第一季', '[法] 克利斯提昂·约里波瓦 著；[法] 克利斯提昂·艾利施 绘；郑迪蔚 译', '二十一世纪出版社', '少儿', 7539105002113, 'images/book_covers/7539105002113.jpg'),
(45, '信谊绘本世界精选图画书：猜猜我有多爱你 ', '[爱尔兰] 山姆·麦克布雷尼 著；[英] 安妮塔·婕朗 绘；梅子涵 译', ' 明天出版社', '少儿', 9787533274269, 'images/book_covers/9787533274269.jpg'),
(46, '朗文·外研社·新概念英语1', '[英] 亚历山大，何其莘 著', '外语教学与研究出版社', '教育', 9787560013466, 'images/book_covers/9787560013466.jpg'),
(47, '15000英语单词便携口袋书', '[加] Jordan Andre，[加] Larissa Cherry，[美] Michael Philip，徐亚静 著；耿小辉，昂秀外语教学研究组 编', '中国出版传媒股份有限公司', '教育', 9787500140290, 'images/book_covers/9787500140290.jpg'),
(48, '牛津高阶英汉双解词典（第8版）', '[英] 霍恩比 著', '商务印书馆', '教育', 9787100105279, 'images/book_covers/9787100105279.jpg'),
(49, '了不起的盖茨比', '[美] 菲茨杰拉德 著；巫宁坤 译', '中国宇航出版社', '教育', 9787515904931, 'images/book_covers/9787515904931.jpg'),
(50, '韩国首尔大学韩国语系列教材', '韩梅，孙玉慧 著；韩国首尔大学语言教育院 编', '外语教学与研究出版社', '教育', 9787560071060, 'images/book_covers/9787560071060.jpg'),
(51, '朝花夕拾/中小学生必读丛书', '鲁迅 著；卢沉 绘', '陕西师范大学出版社', '教育', 9787561345757, 'images/book_covers/9787561345757.jpg'),
(52, '钢铁是怎样炼成的/中小学生必读丛书', '[苏] 尼·奥斯特洛夫斯基 著；刘军 译', '陕西师范大学出版社', '教育', 9787561348567, 'images/book_covers/9787561348567.jpg'),
(53, '傅雷家书：学生读本', '傅雷，朱梅馥，傅聪 著；傅敏 编', ' 天津社会科学院出版社', '教育', 9787556301355, 'images/book_covers/9787556301355.jpg'),
(54, '肖秀荣2017考研政治命题人1000题', '肖秀荣 著', '北京航空航天大学出版社', '教育', 9787512421103, 'images/book_covers/9787512421103.jpg'),
(55, '现代汉语词典（第6版）', '中国社会科学院语言研究所词典编辑室 编', '商务印书馆', '教育', 9787100084673, 'images/book_covers/9787100084673.jpg'),
(56, '古汉语常用字字典（第5版）', '王力，岑麒祥，林焘 等 编；蒋绍愚 唐作藩 张万起 等 整理', '商务印书馆', '教育 ', 9787100119160, 'images/book_covers/9787100119160.jpg'),
(57, '牛津中阶英汉双解词典（第5版）\r\n', '[英] 艾莉森·沃特斯，[英] 维多利亚·布尔 编；刘常华 等 译', '出版社： 商务印书馆', '教育', 9787100122429, 'images/book_covers/9787100122429.jpg'),
(58, '西方经济学 宏观部分（第六版）', '高鸿业，教育部高教司 编', '中国人民大学出版社', '教育', 9787300194967, 'images/book_covers/9787300194967.jpg'),
(59, '工程数学线性代数（第六版）', '同济大学数学系 编', '高等教育出版社', '教育', 9787040396614, 'images/book_covers/9787040396614.jpg'),
(60, '概率论与数理统计（第4版）', '盛骤 等 编', ' 高等教育出版社', '教育', 9787040238969, 'images/book_covers/9787040238969.jpg'),
(61, '刑法学（第五版 上下册）', '张明楷 著', '法律出版社', '教育', 9787511896834, 'images/book_covers/9787511896834.jpg'),
(62, '皮肤性病学(第8版) ', '张学军，陆洪光，高兴华 编', '人民卫生出版社', '教育', 9787117171649, 'images/book_covers/9787117171649.jpg'),
(63, '儿科学(第8版)', '王卫平 编', '人民卫生出版社', '教育', 9787117171366, 'images/book_covers/9787117171366.jpg'),
(64, '营养与食品卫生学（第7版 预防医学类专业）', '孙长颢 编', '人民卫生出版社', '教育', 9787117160636, 'images/book_covers/9787117160636.jpg'),
(65, '计算机组成原理（第2版）', '唐朔飞 著', '高等教育出版社', '教育', 9787040223903, 'images/book_covers/9787040223903.jpg'),
(66, '好吗好的', '大冰 著', '湖南文艺出版社', '小说文学', 9787540476892, 'images/book_covers/9787540476892.jpg'),
(67, '解忧杂货店', '[日] 东野圭吾 著；李盈春 译', '南海出版公司', '小说文学', 9787544270878, 'images/book_covers/9787544270878.jpg'),
(68, '岛上书店', '[美] 加·泽文（Gabrielle Zevin） 著；孙仲旭，李玉瑶 译', '江苏凤凰文艺出版社', '小说文学', 9787539971810, 'images/book_covers/9787539971810.jpg'),
(69, '巨人的陨落（全3册）', '[英] 肯·福莱特（Ken Follett） 著；于大卫 译', '江苏凤凰文艺出版社', '小说文学', 9787539989891, 'images/book_covers/9787539989891.jpg'),
(70, '摆渡人', '[英] 克莱儿·麦克福尔 著；付强 译', '百花洲文艺出版社', '小说文学', 9787550013247, 'images/book_covers/9787550013247.jpg'),
(71, '皮囊', '蔡崇达 著', '天津人民出版社', '小说文学', 9787201088945, 'images/book_covers/9787201088945.jpg'),
(72, '从你的全世界路过', '张嘉佳 著', ' 湖南文艺出版社', '小说文学', 9787540458027, 'images/book_covers/9787540458027.jpg'),
(73, '追风筝的人', '[美] 卡勒德·胡赛尼（Khaled Hosseini） 著；李继宏 译', '上海人民出版社', '小说文学', 9787208061644, 'images/book_covers/9787208061644.jpg'),
(74, '百年孤独', '[哥伦比亚] 加西亚·马尔克斯 著；范晔 译', '南海出版公司', '小说文学', 9787544253994, 'images/book_covers/9787544253994.jpg'),
(75, '嘿，三十岁', '艾明雅 著\r\n', ' 江苏凤凰文艺出版社', '小说文学', 9787539987811, 'images/book_covers/9787539987811.jpg'),
(76, '我们仨', '杨绛 著', '生活·读书·新知三联书店', '小说文学', 9787108042453, 'images/book_covers/9787108042453.jpg'),
(77, '白夜行', '[日] 东野圭吾 著；刘姿君 译', '南海出版公司', '小说文学', 9787544258609, 'images/book_covers/9787544258609.jpg'),
(78, '她和他', '[法] 马克·李维 著；杨亦雨 译', '湖南文艺出版社', '小说文学', 9787540476236, 'images/book_covers/9787540476236.jpg'),
(79, '平凡的世界', '路遥 著', '北京十月文艺出版社', '小说文学', 9787530212004, 'images/book_covers/9787530212004.jpg'),
(80, '孤独是生命的礼物', '周国平，余秋雨，陈忠实 等 著', '百花洲文艺出版社', '小说文学', 9787550013742, 'images/book_covers/9787550013742.jpg'),
(81, '三生三世十里桃花：新版（升级版）', '唐七 著', '湖南文艺出版社', '小说文学', 9787540472252, 'images/book_covers/9787540472252.jpg'),
(82, '活着（新版）', '余华 著', '作家出版社', '小说文学', 9787506365437, 'images/book_covers/9787506365437.jpg'),
(83, '自在独行', '贾平凹 著', '长江文艺出版社', '小说文学', 9787535488473, 'images/book_covers/9787535488473.jpg'),
(84, 'S. 忒修斯之船', '[美] J.J.艾布拉姆斯，[美] 道格·道斯特 著；颜湘如 译', '中信出版集团', '小说文学', 9787508650951, 'images/book_covers/9787508650951.jpg'),
(85, '无声告白', '[美] 伍绮诗 著；孙璐 译', '江苏凤凰文艺出版社', '小说文学', 9787539982830, 'images/book_covers/9787539982830.jpg'),
(86, '销售就是要会提问', '蔡怀东 著', '北京联合出版公司', '经管', 9787550272033, 'images/book_covers/9787550272033.jpg'),
(87, '不懂带人，你就自己干到死', '[比利时] 路易斯·卡夫曼 著；若水 译', '印刷工业出版社', '经管', 9787514206630, 'images/book_covers/9787514206630.jpg'),
(88, '从0到1', '[美] 彼得·蒂尔，布莱克·马斯特斯（Blake Masters） 著；高玉芳 译', '中信出版社', '经管', 9787508649719, 'images/book_covers/9787508649719.jpg'),
(89, '影响力（经典版）', '[美] 罗伯特·B·西奥迪尼（Robert B. Cialdini） 著；闾佳 译', '万卷出版公司', '经管', 9787547012123, 'images/book_covers/9787547012123.jpg'),
(90, '卓有成效的管理者', '[美] 彼得·德鲁克 著', '机械工业出版社', '经管', 9787111280712, 'images/book_covers/9787111280712.jpg'),
(91, '商业的本质', '[美] 杰克·韦尔奇，[美] 苏茜·韦尔奇 著；蒋宗强 译', '中信出版集团', '经管', 9787508658339, 'images/book_covers/9787508658339.jpg'),
(92, '从零开始读懂金融学', '斯凯恩 著', '立信会计出版社', '经管', 9787542941930, 'images/book_covers/9787542941930.jpg'),
(93, '富爸爸穷爸爸', '美] 罗伯特·清崎，[美] 莎伦·莱希特 著；萧明 译', '四川文艺出版社', '经管', 9787541138126, 'images/book_covers/9787541138126.jpg'),
(94, '股票投资入门与实战技巧 从零开始学炒股', '王坤 著', '团结出版社', '经管', 9787512615557, 'images/book_covers/9787512615557.jpg'),
(95, '高抛低吸：股票T+0滚动交易法', '李一波 著', '经济管理出版社', '经管', 9787509629161, 'images/book_covers/9787509629161.jpg'),
(96, '斯坦福极简经济学', '[美] 蒂莫西·泰勒 著；林隆全 译', '湖南人民出版社', '经管', 9787556107391, 'images/book_covers/9787556107391.jpg'),
(97, '创始人1984', '陈润 著', '华中科技大学出版社', '经管', 9787568009249, 'images/book_covers/9787568009249.jpg'),
(98, '大数据时代', '[英] 维克托·迈尔-舍恩伯格，[英] 肯尼思·库克耶 著；盛杨燕，周涛 译', '浙江人民出版社', '经管', 9787213052545, 'images/book_covers/9787213052545.jpg'),
(99, '思考，快与慢', '[美] 丹尼尔·卡尼曼 著；胡晓姣，李爱民，何梦莹 译', '中信出版社', '经管', 9787508633558, 'images/book_covers/9787508633558.jpg'),
(100, '鸿观', '宋鸿兵 著', ' 广东人民出版社', '经管', 9787218109145, 'images/book_covers/9787218109145.jpg'),
(101, '经济学原理 ', '[美] 曼昆（N.Gregory Mankiw） 著；梁小民，梁砾 译', '北京大学出版社', '经管', 9789900161998, 'images/book_covers/9789900161998.jpg'),
(102, '营改增实战', '赵金梅，马郡 著', '机械工业出版社', '经管', 9787111534990, 'images/book_covers/9787111534990.jpg'),
(103, '逆向管理', '【美】埃米尼亚·伊贝拉 著', '北京联合出版公司', '经管', 9787550279438, 'images/book_covers/9787550279438.jpg'),
(104, '金字塔原理大全集', '[美] 芭芭拉·明托 著；汪洱，高愉 译', '南海出版公司', '经管', 9787544270809, 'images/book_covers/9787544270809.jpg'),
(105, '巴菲特之道（原书第3版）', '[美] 罗伯特·哈格斯特朗 著；杨天南 译', '机械工业出版社', '经管', 9787111493624, 'images/book_covers/9787111493624.jpg'),
(106, '最简单的方式：《零极限》之实践篇', '[美] 玛贝尔·卡茨 著；宋晓飒 译', '华夏出版社', '励志与成功', 9787508058931, 'images/book_covers/9787508058931.jpg'),
(107, '精进', '采铜 著', '江苏凤凰文艺出版社', '励志与成功', 9787539990484, 'images/book_covers/9787539990484.jpg'),
(108, '职场基本功', '李文勇 著', '北方妇女儿童出版社', '励志与成功', 9787538596847, 'images/book_covers/9787538596847.jpg'),
(109, '优秀的人，都敢对自己下狠手', '陈立飞 著', '北京联合出版公司', '励志与成功', 9787550279469, 'images/book_covers/9787550279469.jpg'),
(110, '神奇手账', '[日] 佐藤惠 著；蔡丽蓉 译', '北方妇女儿童出版社', '励志与成功', 9787538593631, 'images/book_covers/9787538593631.jpg'),
(111, '高效能人士的七个习惯', '[美] 史蒂芬·柯维 著；高新勇，王亦兵，葛雪蕾 译', '中国青年出版社', '励志与成功', 9787515326399, 'images/book_covers/9787515326399.jpg'),
(112, '遇见未知的自己', '张德芬 著', '湖南文艺出版社', '励志与成功', 9787540475017, 'images/book_covers/9787540475017.jpg'),
(113, '演讲的力量', '[美] 克里斯·安德森（Chris Anderson） 著；蒋贤萍 译', '中信出版集团', '励志与成功', 9787508662053, 'images/book_covers/9787508662053.jpg'),
(114, '我喜欢这个功利的世界', '咪蒙 著', '湖南文艺出版社', '励志与成功', 9787540475437, 'images/book_covers/9787540475437.jpg'),
(115, '别让不好意思害了你', '周维丽 著', '北京理工大学出版社', '励志与成功', 9787564051532, 'images/book_covers/9787564051532.jpg'),
(116, '跟任何人都聊得来', '[美] 迈克·贝克特尔 著；陈芳芳 译', '九州出版社', '励志与成功', 9787510829826, 'images/book_covers/9787510829826.jpg'),
(117, '你的坚持 终将美好', '人民日报社新媒体中心 著', '北京联合出版公司', '励志与成功', 9787550279452, 'images/book_covers/9787550279452.jpg'),
(118, '当你的才华还撑不起你的梦想时', '特立独行的猫 著', ' 武汉出版社', '励志与成功', 9787543096158, 'images/book_covers/9787543096158.jpg'),
(119, '戒了吧！拖延症', '辰格 著', '天津人民出版社', '励志与成功', 9787201084152, 'images/book_covers/9787201084152.jpg'),
(120, '别让不会说话害了你', '陈玮 著', '中国商业出版社', '励志与成功', 9787504477897, 'images/book_covers/9787504477897.jpg'),
(121, '洗脑术', '高德 著', '江苏文艺出版社', '励志与成功', 9787539959627, 'images/book_covers/9787539959627.jpg'),
(122, '沟通的艺术', '[美] 罗纳德·B·阿德勒，拉塞尔·F·普罗科特 著；黄素菲，李恩 译', ' 世界图书出版公司', '励志与成功', 9787510077463, 'images/book_covers/9787510077463.jpg'),
(123, '别扯了，时间才不会改变一切', '王远成 著', '武汉出版社', '励志与成功', 9787558205040, 'images/book_covers/9787558205040.jpg'),
(124, '向前一步', '[美] 谢丽尔·桑德伯格 著；颜筝，曹定，王占华 译', '中信出版社', '励志与成功', 9787508646244, 'images/book_covers/9787508646244.jpg'),
(125, '你只是看起来很努力', '李尚龙 著', '中国友谊出版公司', '励志与成功', 9787505735361, 'images/book_covers/9787505735361.jpg'),
(126, '世界简史', '[英] 赫伯特·乔治·威尔斯 著；谢凯 译', ' 民主与建设出版社', '人文社科', 9787513907026, 'images/book_covers/9787513907026.jpg'),
(127, '天才在左疯子在右', '高铭 著', '北京联合出版公司', '人文社科', 9787550263932, 'images/book_covers/9787550263932.jpg'),
(128, '羊皮卷', '[美] 卡耐基 著；陈肯 译', '北方妇女儿童出版社', '人文社科', 9787538583502, 'images/book_covers/9787538583502.jpg'),
(129, '人类简史 ', '[以色列] 尤瓦尔·赫拉利 著；林俊宏 译', '中信出版社', '人文社科', 9787508647357, 'images/book_covers/9787508647357.jpg'),
(130, '悦读时光·你若盛开，清风自来', '杨承清 著', '北方妇女儿童出版社', '人文社科', 9787538588361, 'images/book_covers/9787538588361.jpg'),
(131, '聪明人总能避免的66个逻辑陷阱\r\n', '李子墨 著', '北京理工大学出版社', '人文社科', 9787568203593, 'images/book_covers/9787568203593.jpg'),
(132, '性格心理学', '邹宏明 著', '鹭江出版社', '人文社科', 9787545910056, 'images/book_covers/9787545910056.jpg'),
(133, '自控力', '[美] 凯利·麦格尼格尔 著；王岑卉 译', '文化发展出版社', '人文社科', 9787514205039, 'images/book_covers/9787514205039.jpg'),
(134, '儿童行为心理学', '李群锋 著', '古吴轩出版社', '人文社科', 9787554606926, 'images/book_covers/9787554606926.jpg'),
(135, '乌合之众 大众心理研究', '[法] 古斯塔夫·勒庞 著；冯克利 译', '中央编译出版社', '人文社科', 9787801093660, 'images/book_covers/9787801093660.jpg'),
(136, '微表情心理学', '马浩天 著', '古吴轩出版社', '人文社科', 9787554606841, 'images/book_covers/9787554606841.jpg'),
(137, '大好河山可骑驴', '王这么 著', '长江文艺出版社', '人文社科', 9787535484055, 'images/book_covers/9787535484055.jpg'),
(138, '用年表读懂中国史', '马东峰，张景忠 著', '北京理工大学出版社', '人文社科', 9787564078133, 'images/book_covers/9787564078133.jpg'),
(139, '社会心理学', '[美] 戴维·迈尔斯（David Myers） 著；侯玉波，乐国安，张智勇 等 译', '人民邮电出版社', '人文社科', 9787115410047, 'images/book_covers/9787115410047.jpg'),
(140, '谷物大脑', '[美] 戴维·珀尔玛特（David Perlmutter），[美] 克里斯廷·洛伯格（Kristin Loberg） 著；温旻 译', '机械工业出版社', '人文社科', 9787111499411, 'images/book_covers/9787111499411.jpg'),
(141, '如何阅读一本书', '[美] 莫提默·J.艾德勒，[美] 查尔斯·范多伦 著', '商务印书馆', '人文社科', 9787100040945, 'images/book_covers/9787100040945.jpg'),
(142, '九型人格', '帕尔默 著', '华夏出版社', '人文社科', 9787508086149, 'images/book_covers/9787508086149.jpg'),
(143, '非暴力沟通', '马歇尔·卢森堡 著', '华夏出版社', '人文社科', 9787508086156, 'images/book_covers/9787508086156.jpg'),
(144, '自卑与超越', '[奥] 阿弗雷德·阿德勒 著', '沈阳出版社', '人文社科', 9787544149082, 'images/book_covers/9787544149082.jpg'),
(145, '暗示心理学', '张弛 著', '煤炭工业出版社', '人文社科', 9787502047931, 'images/book_covers/9787502047931.jpg'),
(146, '走遍中国：西藏（第四版）', '《走遍中国》编辑部 编', '中国旅游出版社', '生活', 9787503248955, 'images/book_covers/9787503248955.jpg'),
(147, '图说天下·国家地理系列：走遍中国', '《图说天下·国家地理系列》编委会 编', '北京联合出版公司', '生活', 9787550207516, 'images/book_covers/9787550207516.jpg'),
(148, '孩子爱吃的一日三餐', '王松青，贾娟，双福 等 著', ' 化学工业出版社', '生活', 9787122242303, 'images/book_covers/9787122242303.jpg'),
(149, '新编百姓最爱家常菜2888例', '双福，朱太治 等 著', '化学工业出版社', '生活', 9787122217936, 'images/book_covers/9787122217936.jpg'),
(150, '瘦孕', '邱锦伶 著', '中国戏剧出版社', '生活', 9787104037989, 'images/book_covers/9787104037989.jpg'),
(151, '我爱面包机！', '日] 主妇之友社 著；姜婧 译', '北京科学技术出版社', '生活', 9787530457023, 'images/book_covers/9787530457023.jpg'),
(152, '为何爱会伤人', '武志红 著', '北京联合出版公司', '生活', 9787550209671, 'images/book_covers/9787550209671.jpg'),
(153, '小家，越住越大', '逯薇 著', '中信出版集团', '生活', 9787508660196, 'images/book_covers/9787508660196.jpg'),
(154, '新手养花不败指南', '王意成 著', '中国水利水电出版社', '生活', 9787517015604, 'images/book_covers/9787517015604.jpg'),
(155, '住宅设计解剖书', '[日] 增田奏 著；赵可 译', '南海出版公司', '生活', 9787544266741, 'images/book_covers/9787544266741.jpg'),
(156, '花束设计与制作', '[日] 桥口学 著；王秋琳 译', '化学工业出版社', '生活', 9787122248909, 'images/book_covers/9787122248909.jpg'),
(157, '收纳全书', '[日] 文化出版局 著；游韵馨 译', '北京联合出版公司', '生活', 9787550257665, 'images/book_covers/9787550257665.jpg'),
(158, '猫咪家庭医学', '[中国台湾] 林政毅，陈千雯 著', '电子工业出版社', '生活', 9787121282133, 'images/book_covers/9787121282133.jpg'),
(159, '图解舌诊', '罗大伦 著', '江西科学技术出版社', '生活', 9787539052946, 'images/book_covers/9787539052946.jpg'),
(160, '本草纲目', '[明] 李时珍 著；倪泰一，李智谋 译', ' 江苏人民出版社', '生活', 9787214067203, 'images/book_covers/9787214067203.jpg'),
(161, '核心稳定性训练', '[美] 霍利斯·兰斯·利伯曼（Hollis Lance Liebman） 著；杨溪 译', '人民邮电出版社', '生活', 9787115369543, 'images/book_covers/9787115369543.jpg'),
(162, '优雅', '晓雪 著', '广西师范大学出版社', '生活', 9787549511525, 'images/book_covers/9787549511525.jpg'),
(163, '每天1碗瘦身沙拉', '杨进书，曲松，双福 著', '化学工业出版社', '生活 ', 9787122238399, 'images/book_covers/9787122238399.jpg'),
(164, 'Vogue的真相', '[澳] 科斯蒂·克莱门茨 著；高银伶，张浩 译', '中信出版社', '生活', 9787508646923, 'images/book_covers/9787508646923.jpg'),
(165, '协和怀孕大百科', '何萃华 著', '中国人口出版社', '生活 ', 9787510126383, 'images/book_covers/9787510126383.jpg'),
(166, '怀孕胎教知识百科全书', '艾贝母婴研究中心 编', '四川科学技术出版社', '生活', 9787536480728, 'images/book_covers/9787536480728.jpg'),
(167, '拉伸运动系统训练（全彩图解第2版）', '[美] 阿诺德·G·尼尔森（Arnold G. Nelson），[美] 尤卡·科科宁（Jouko Kokkonen） 著；王会寨，杨倩倩 译', '人民邮电出版社', '生活', 9787115409119, 'images/book_covers/9787115409119.jpg'),
(168, '倒转金字塔', '[英] 乔纳森·威尔逊 著；迪生，徐天辰 译；蝶歌 等 校', '湖北科学技术出版社', '生活', 9787535264947, 'images/book_covers/9787535264947.jpg'),
(169, '360度无死角肌肤养护法', '李士虹 著', '北京时代华文书局', '生活', 9787569903409, 'images/book_covers/9787569903409.jpg'),
(170, '在阳台上种菜', '[日] 藤田智 著；[日] Nakakoji mutsuyo 绘；烟雨 译', '浙江科学技术出版社', '生活', 9787534140723, 'images/book_covers/9787534140723.jpg'),
(171, '花式营养早餐', '双福 等 著', '化学工业出版社', '生活', 9787122226549, 'images/book_covers/9787122226549.jpg'),
(172, '中国居民膳食指南（2016）', '中国营养学会 著', '人民卫生出版社', '生活', 9787117222143, 'images/book_covers/9787117222143.jpg'),
(173, '跟着君之学烘焙', '君之 著', '北京科学技术出版社', '生活', 9787530479353, 'images/book_covers/9787530479353.jpg'),
(174, '答案之书', '保罗 著', '百花洲文艺出版社', '生活', 9787550017719, 'images/book_covers/9787550017719.jpg'),
(175, '中国传统风水智慧一本通（权威修订典藏版）\r\n', '陈晓倩 著', '中国画报出版社', '生活', 9787802203846, 'images/book_covers/9787802203846.jpg'),
(176, '设计中的设计', '[日] 原研哉 著；朱锷 译', '山东人民出版社', '艺术/摄影', 9787209041065, 'images/book_covers/9787209041065.jpg'),
(177, '写给大家的西方美术史', '蒋勋 著', '湖南美术出版社', '艺术/摄影', 9787535672100, 'images/book_covers/9787535672100.jpg'),
(178, '故事', '罗伯特·麦基 著；周铁东 译', '天津人民出版社', '艺术/摄影', 9787201094601, 'images/book_covers/9787201094601.jpg      '),
(179, '配色设计原理', '[日] 奥博斯科编辑部 编', '中国青年出版社', '艺术/摄影', 9787500690351, 'images/book_covers/9787500690351.jpg'),
(180, '平面设计中的网格系统', '[瑞士] 约瑟夫·米勒-布罗克曼 著；徐宸熹，张鹏宇 译', '上海人民美术出版社', '艺术/摄影', 9787532298570, 'images/book_covers/9787532298570.jpg'),
(181, '美的沉思', '蒋勋 著', '湖南美术出版社', '艺术/摄影', 9787535669599, 'images/book_covers/9787535669599.jpg'),
(182, '美国纽约摄影学院摄影教材', '美国纽约摄影学院 编', '中国摄影出版社', '艺术/摄影', 9787802363595, 'images/book_covers/9787802363595.jpg'),
(183, '单反摄影实拍圣经', '王玉琦，赵丽华 著', '中国水利水电出版社', '艺术/摄影', 9787508496528, 'images/book_covers/9787508496528.jpg'),
(184, '拍出绝世美姿', '[美] Roberto Valenzuela 著；马雁翔 译', '人民邮电出版社', '艺术/摄影', 9787115372109, 'images/book_covers/9787115372109.jpg'),
(185, '摄影眼的培养', 'DIGIPHOTO 编辑部 编', '中信出版社', '艺术/摄影', 9787508637709, 'images/book_covers/9787508637709.jpg'),
(186, 'Amily的可爱手绘生活', 'Amily 著；沈凤如 译', '化学工业出版社', '艺术/摄影', 9787122248688, 'images/book_covers/9787122248688.jpg'),
(187, '让画画变轻松', '[美] 埃德温·鲁兹 著；张雪颖 译', '哈尔滨出版社', '艺术/摄影', 9787548421726, 'images/book_covers/9787548421726.jpg'),
(188, '素描基础教程', '张恒国 著', '化学工业出版社', '艺术/摄影', 9787122081872, 'images/book_covers/9787122081872.jpg'),
(189, '哈农钢琴练指法', '[法] 哈农 著；王九丁 译', '人民音乐出版社', '艺术/摄影', 9787103021767, 'images/book_covers/9787103021767.jpg'),
(190, '吉他入门经典教程', '李国标 著', '化学工业出版社', '艺术/摄影', 9787122225245, 'images/book_covers/9787122225245.jpg'),
(191, '演员自我修养', '[俄] 斯坦尼斯拉夫斯基 著；刘杰 译', ' 华中科技大学出版社', '艺术/摄影', 9787568006804, 'images/book_covers/9787568006804.jpg'),
(192, '写给大家的中国美术史', '蒋勋 著', '生活·读书·新知三联书店', '艺术/摄影', 9787108053138, 'images/book_covers/9787108053138.jpg'),
(193, '平面设计完全手册 ', '[德] 马库斯·韦格 著；张影，周秋实 译', '北京科学技术出版社', '艺术/摄影', 9787530470954, 'images/book_covers/9787530470954.jpg'),
(194, '音乐理论基础', '李重光 著；李重光 编', '人民音乐出版社', '艺术/摄影', 9787103003466, 'images/book_covers/9787103003466.jpg'),
(195, '约翰·汤普森简易钢琴教程', '[美] 约翰·汤普森 著', '上海音乐出版社', '艺术/摄影', 9787805535999, 'images/book_covers/9787805535999.jpg'),
(196, '什么是科学', '吴国盛 著', ' 广东人民出版社', '科技', 9787218110219, 'images/book_covers/9787218110219.jpg'),
(197, '物种起源', '[英] 查理·达尔文 著；钱逊 译', '江苏人民出版社', '科技', 9787214067173, 'images/book_covers/9787214067173.jpg'),
(198, '相对论', '[美] 阿尔伯特·爱因斯坦 著；易洪波，李智谋 译', '江苏人民出版社', '科技', 9787214067821, 'images/book_covers/9787214067821.jpg'),
(199, '生命的未来', '[美] 克雷格·文特尔 著；贾拥民 译', '浙江人民出版社', '科技', 9787213073090, 'images/book_covers/9787213073090.jpg'),
(200, '工匠精神', '曹顺妮 著', '机械工业出版社', '科技', 9787111534365, 'images/book_covers/9787111534365.jpg'),
(201, '建筑设计防火规范（GB 50016-2014）', '中华人民共和国住房和城乡建设部，中华人民共和国国家质量监督检验检疫总局 编', '中国计划出版社', '科技', 9158024257601, 'images/book_covers/9158024257601.jpg'),
(202, '全球最美100个建筑奇迹 ', '《图行世界》编辑部 编', '中国旅游出版社', '科技', 9787503253546, 'images/book_covers/9787503253546.jpg'),
(203, 'React 精髓', '[英] Artemij Fedosejev（阿尔乔姆 . 费多耶夫） 著；奇舞团 译', '电子工业出版社', '科技', 9787121286469, 'images/book_covers/9787121286469.jpg'),
(204, 'RabbitMQ实战', '[美] Alvaro Videla，[美] Jason J.W.Williams 著；汪佳南 译', '电子工业出版社', '科技', 9787121271649, 'images/book_covers/9787121271649.jpg'),
(205, '怎样识读电子电路图', '门宏 著', '人民邮电出版社', '科技', 9787115228239, 'images/book_covers/9787115228239.jpg'),
(206, 'WHAT IF那些古怪又让人忧心的问题', '兰道尔·门罗 著；朱君玺 译', '北京联合出版公司', '科技', 9787550277014, 'images/book_covers/9787550277014.jpg'),
(207, '无言的宇宙', '[美] 达纳·麦肯齐 著；李永学 译', '北京联合出版公司', '科技', 9787550244658, 'images/book_covers/9787550244658.jpg'),
(208, '科学的旅程', '[美] 雷·斯潘根贝格（Ray Spangenburg），戴安娜·莫泽（Diane Kit Moser） 著；郭奕玲，陈蓉霞，沈慧君 译', '北京大学出版社', '科技', 9787301236321, 'images/book_covers/9787301236321.jpg'),
(209, '生态农业观光园规划：理念与案例', '黄毅斌，刘晖，翁伯琦 等 著', '中国农业科学技术出版社', '科技', 9787511611482, 'images/book_covers/9787511611482.jpg'),
(210, '万物解释者', '兰道尔·门罗（Randall Munroe） 著；孙璐 译', '北京联合出版公司', '科技', 9787550278592, 'images/book_covers/9787550278592.jpg'),
(211, '趣味物理学', '[苏] 雅科夫·伊利达洛维奇·别莱利曼 著；戴光年 译', '武汉出版社', '科技', 9787543055513, 'images/book_covers/9787543055513.jpg'),
(212, '地球与太空', '尼尔马拉·纳塔瑞杰 著；美国航空航天局（NASA） 绘；董乐乐 译', '北京联合出版公司', '科技', 9787550260597, 'images/book_covers/9787550260597.jpg'),
(213, '贤二机器僧漫游人工智能', '杨朴宇，刘鹄伟，杨朴伟 著', ' 北京联合出版公司', '科技', 9787550284258, 'images/book_covers/9787550284258.jpg'),
(214, '哈利波特与被诅咒的孩子（美国版）', 'J.K. Rowling，Jack Thorne，John Tiffany 著', 'Scholastic US', '英文书/港台书', 9781338099133, 'images/book_covers/9781338099133.jpg'),
(215, 'I Am a Bunny ', 'Ole Risom（欧雷·里索姆），Richard Scarry（理查德·斯凯瑞） 著', 'Golden Books', '英文书/港台书', 9780375827785, 'images/book_covers/9780375827785.jpg'),
(216, 'Dear Zoo: A Lift-the-Flap Book', 'Rod Campbell（罗德·坎贝尔） 著；Rod Campbell（罗德·坎贝尔） 绘', 'Simon & Schuster US', '英文书/港台书', 9781416947370, 'images/book_covers/9781416947370.jpg'),
(217, 'Fifty Great Short Stories', 'Milton Crane（密尔顿·克瑞恩） 著', 'Random House', '英文书/港台书', 9780553277456, 'images/book_covers/9780553277456.jpg'),
(218, 'Merriam-Webster''s Vocabulary Builder ', 'Merriam-Webster 著', 'Merriam Webster Mass Market', '英文书/港台书', 9780877798552, 'images/book_covers/9780877798552.jpg'),
(219, 'Richard Scarry''s Best Word Book Ever', 'Richard Scarry（理查德·斯凯瑞） 著', 'Random House', '英文书/港台书', 9780307155108, 'images/book_covers/9780307155108.jpg'),
(220, '美國家庭萬用親子英文 ', '洪賢珠/ 尹載元 著', '國際學村出版社', '英文书/港台书', 9789866077388, 'images/book_covers/9789866077388.jpg'),
(221, '一課經濟學（50週年紀念版）', '亨利·赫茲利特（Henry Hazlitt） 著；罗耀宗 译', '經濟新潮出版社', '英文书/港台书', 9789866031151, 'images/book_covers/9789866031151.jpg'),
(222, '浮生六記', '沈三白 著；王關仕 校；陶恂若 注', '三民書局', '英文书/港台书', 9789571428154, 'images/book_covers/9789571428154.jpg'),
(223, 'S.希修斯之船', 'J. J. 亞伯拉罕（J. J. Abrams），道格．道斯特（Doug Dorst） 著；顏湘如 译', '寂寞出版股份有限公司', '英文书/港台书', 9789869014946, 'images/book_covers/9789869014946.jpg'),
(224, '別鬧了，費曼先生', '理查·費曼 著；吳程遠 译', '天下遠見出版股份有限公司', '英文书/港台书', 9789864171156, 'images/book_covers/9789864171156.jpg'),
(225, '新譯古文觀止（增訂5版）', '謝冰瑩，應裕康，邱燮友 等 著；謝冰瑩<注譯>，應裕康<注譯>，邱燮友<注譯> 等 译', '三民書局印行', '英文书/港台书', 9789571456072, 'images/book_covers/9789571456072.jpg'),
(226, '三國演義', '羅貫中 著', ' 三民書局', '英文书/港台书', 9789571407722, 'images/book_covers/9789571407722.jpg'),
(227, '读者合订本（2016年春季卷 总606-611期）', '读者编辑部 编', '读者杂志社', '杂志期刊', 9771005180158, 'images/book_covers/9771005180158.jpg'),
(228, '意林合订本（2016年01期-06期，总第48卷 春季卷 经典收藏本）', '蔡燕 编', '意林杂志社', '杂志期刊', 9771007384158, 'images/book_covers/9771007384158.jpg'),
(229, '中国国家地理（2016年8月号）', '单之蔷 著', '《中国国家地理》杂志社', '杂志期刊', 9771009633001, 'images/book_covers/9771009633001.jpg');

-- --------------------------------------------------------

--
-- 表的结构 `match_table`
--

CREATE TABLE `match_table` (
  `USER_NAME` text NOT NULL,
  `BOOK_ISBN` text NOT NULL COMMENT '字符串，应用端自行split',
  `BOOK_BORROWED_NUM` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `match_table`
--

INSERT INTO `match_table` (`USER_NAME`, `BOOK_ISBN`, `BOOK_BORROWED_NUM`) VALUES
('alice', '9787121271649,9787115369543,9787508646923,9787569903409,9787513907026', 5),
('gloria', '9787545910056,9787100040945,9787540475017', 3),
('jack', '9787302287568,9787115279460,9787550260597,9787550244658,9771009633001,9787508496528', 6),
('mike', '9789571428154,9789571407722', 2);

-- --------------------------------------------------------

--
-- 表的结构 `user_table`
--

CREATE TABLE `user_table` (
  `ID` int(10) UNSIGNED NOT NULL,
  `NAME` varchar(16) NOT NULL,
  `PASSWORD` varchar(16) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user_table`
--

INSERT INTO `user_table` (`ID`, `NAME`, `PASSWORD`) VALUES
(1, 'jack', 'jack'),
(2, 'mike', 'mike'),
(3, 'alice', 'alice'),
(4, 'gloria', 'gloria'),
(5, 'admin', 'admin');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `book_table`
--
ALTER TABLE `book_table`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `ID` (`ID`),
  ADD UNIQUE KEY `ISBN` (`ISBN`);

--
-- Indexes for table `match_table`
--
ALTER TABLE `match_table`
  ADD PRIMARY KEY (`USER_NAME`(128));

--
-- Indexes for table `user_table`
--
ALTER TABLE `user_table`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `NAME` (`NAME`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `book_table`
--
ALTER TABLE `book_table`
  MODIFY `ID` int(11) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT '内部使用', AUTO_INCREMENT=230;
--
-- 使用表AUTO_INCREMENT `user_table`
--
ALTER TABLE `user_table`
  MODIFY `ID` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
